[
    {
        "id": 1,
        "nome": "PHP",
        "fatto": true,
        "descrizione": "PHP (Hypertext Preprocessor): È un linguaggio di programmazione server-side usato per generare contenuti dinamici, gestire database e autenticare utenti nelle applicazioni web."
    },
    {
        "id": 2,
        "nome": "JavaScript",
        "fatto": true,
        "descrizione": "JavaScript (JS): È un linguaggio di programmazione client-side che aggiunge interattività e dinamismo alle pagine web, come animazioni, aggiornamenti in tempo reale e gestione degli eventi."
    },
    {
        "id": 3,
        "nome": "Python",
        "fatto": false,
        "descrizione": "Python: È un linguaggio di programmazione ad alto livello, semplice e leggibile, usato per sviluppo web, automazione, data science e intelligenza artificiale. Ha una sintassi chiara e una vasta libreria di moduli."
    },
    {
        "id": 4,
        "nome": "CSS",
        "fatto": true,
        "descrizione": "CSS (Cascading Style Sheets): È il linguaggio di stile utilizzato per definire l'aspetto delle pagine web, controllando colori, font, layout e responsività."
    },
    {
        "id": 5,
        "nome": "Java",
        "fatto": false,
        "descrizione": "Java: È un linguaggio di programmazione orientato agli oggetti, famoso per la sua portabilità. È ampiamente usato nello sviluppo di applicazioni aziendali, Android e software multipiattaforma."
    },
    {
        "id": 6,
        "nome": "C++",
        "fatto": false,
        "descrizione": "C++: È un linguaggio di programmazione potente e performante, utilizzato per lo sviluppo di software di sistema, videogiochi e applicazioni ad alte prestazioni. Supporta programmazione orientata agli oggetti e gestione avanzata della memoria."
    },
    {
        "id": 7,
        "nome": "HTML",
        "fatto": true,
        "descrizione": "HTML (HyperText Markup Language): È il linguaggio di markup usato per strutturare le pagine web, definendo elementi come testi, immagini, link e sezioni della pagina."
    }
]